// ------------------------ 角色開始 ------------------------ 開始 //
const characterList = [
  {
    id: 1,
    dynasty: "先秦",
    avatar: [
      {
        type: "天",
        num: "003",
        cv: "趙路",
        hobby: "雅宴、弈棋",
        origin: "【漢】司馬遷《史記·老子韓非列傳》",
        impression:
          "生為韓國公子，命遇戰國亂世，韓非將他的謀算藏在心底，抱負訴於筆下，窺測世情，洞察人性。君臣之道為何，駕馭天下之法為何？刑名律條當如何解，太平盛世又將安在？韓非沉潛於治亂興亡之道，將所得凝結為歷歷書簡。甚至如今在忘川，他也時刻關注著後世之事，好讓自己的學說與時俱進。",
      },
      {
        type: "天",
        num: "009",
        cv: "史澤鯤",
        hobby: "博文、雅宴",
        origin: "【西漢】司馬遷《史記》",
        impression:
          "屈原一度受楚王重用，有明於治亂、嫻於辭令之譽。可惜身不由己、事與願違，他想要施展才華，卻遭遇兩次流放；渴望守護楚國，卻只能遙泣郢都城破。屈原不容許自身皓皓之白蒙受俗塵的侵染，亦不堪親眼目送故國的小舟傾覆於亂世的驚濤。幾度江潭羈旅，日日憔悴行吟，雖曾逢漁父一言相勸，他終不改狐死首丘之心，親踐寧赴湘流之語。",
      },
      {
        type: "天",
        num: "016",
        cv: "龜娘",
        hobby: "樂舞、品茗",
        origin: "【戰國】墨翟及其弟子等《墨子·親士》\n【東漢】趙曄《吳越春秋》",
        impression:
          "西施是水做的人兒，清澈如水，溫柔如水，乾淨亦如水。西施的居所纖塵不染，洗得鋥亮的地面莫說一根頭髮，便是一粒灰塵也見不到，來訪者亦被要求換上西施家中特備的木屐。西施的衣裳總是時時刻刻煥亮如新，縱是披地的白紗也不曾沾染些許醃臜，令忘川名士們嘖嘖稱奇。",
      },
      {
        type: "天",
        num: "038",
        cv: "程玉珠",
        hobby: "博文、弈棋",
        origin:
          "【春秋】孫武《孫子兵法·用間》\n戰國】佚名《逸周書·卷四·克殷解》\n【戰國】尉繚《尉繚子·武議》\n漢】司馬遷《史記·齊太公世家》",
        impression:
          "旁人總覺得姜太公德高望重，應當是仙風道骨或威嚴有加之人，其實不然。遍嘗過市井冷眼，也享受過萬人尊崇的太公，在來到忘川之後，每穿著似平民老叟，一魚簍，一斗笠，一竿，一河，怡然自得。返璞歸真，用以形容姜太公，則恰如其分。又有誰能瞧出，那個在忘川畔垂釣的平凡老翁，曾是一釣顯貴的“師尚父”呢？",
      },
      {
        type: "地",
        num: "047",
        cv: "斑馬",
        hobby: "賞玩、弈棋",
        origin:
          "【漢】司馬遷《史記·越王勾踐世家》\n【漢】趙曄《吳越春秋·勾踐入臣外傳》",
        impression:
          "范蠡初到忘川時，憑藉純真善良的孩童樣貌，賺得一手好人緣。可沒過幾日，名士們就發現，這小孩沒這麼簡單。他無賴起來能將普通石頭當作玉石，把劉邦誆得團團轉；正經起來又能一語道破張良的君臣之道。財神爺眼珠轉上一轉，就有人要做虧本買賣。“倚小賣小”一詞幾乎被他寫在臉上，也無人奈何得了。有人疑惑為何佛印要以孩童面貌來到忘川，可范蠡做如此選擇，在眾名士眼中似乎順理成章：永遠保持好奇，永遠樂於尋求變化和機遇。",
      },
      {
        type: "地",
        num: "051",
        cv: "樊俊航",
        hobby: "雅宴、演武",
        origin: "【漢】司馬遷《史記·刺客列傳》\n【漢】劉向《戰國策·燕策》",
        impression:
          "荊軻一生最重，莫過於一個“義”字。他一生中最重要的兩個人，一個是燕太子丹。他頂著易水河畔的刺骨冷風、冒著秦軍鐵蹄的滾滾煙塵，抱著必死的決心走進秦國王宮，都只為回報燕太子丹的知遇之恩。另一個是高漸離，在秦王宮的大殿上，看著自己的鮮血流淌滿地的那一刻，荊軻最遺憾的，是再也聽不見漸離的築聲。",
      },
      {
        type: "地",
        num: "063",
        cv: "沈磊",
        hobby: "雅宴、樂舞",
        origin: "【漢】司馬遷《史記·刺客列傳》\n【漢】劉向《戰國策·燕策》",
        impression:
          "他的築聲能引忘川飛鳥停歇，群獸止步。有人說他是忘川中最易相處之人，卻又是最難親近之人。他好像林間清風，待人永遠溫文爾雅，遇之令人心曠神怡，卻又像山中明月，遙隔萬裡，旁人永遠無法進入他真正的內心。",
      },
      {
        type: "玄",
        num: "093",
        cv: "沈磊",
        hobby: "雅宴、食珍",
        origin: "【漢】趙曄《吳越春秋·闔閭內傳》\n【三國】曹丕《列異傳》",
        impression:
          "有干將的地方，就有打鐵聲，日夜不歇，名士們不堪其擾，頂著烏黑的眼眶來找干將算賬。卻見干將鑄完的新劍，投入爐中熔斷。其劍鋒芒耀目，吹發可斷，堪稱“神兵”，在場名士莫不惋惜，詢問其因，干將卻只掄了掄錘子，不發一言，又投入了下一把新劍的鍛造中。其實，如今的干將不僅是鑄劍師，也是首飾打造師，噓，此為機密。沒人知道干將這樣一個漢子，如何能有這等巧思",
      },
    ],
  },
  {
    id: 2,
    dynasty: "秦",
    avatar: [
      {
        type: "天",
        num: "002",
        cv: "吳磊",
        hobby: "演武、賞玩",
        origin:
          "【漢】司馬遷《史記·秦始皇本紀》\n【明】李贄《藏書·世紀列傳總目》",
        impression:
          "嬴政到了忘川不久，便當選為千工社社長，主持兵馬俑修造事宜，為此殫精竭慮，耗費萬金。家中圖紙盈室，旁人過府拜謁，幾乎沒有落腳的地方，再一看臥室，竟連床上都堆滿了石膏部件。生前大肆修造陶俑便罷了，死後也不甘休，忘川名士都議論紛紛，甚為不解。嬴政統統不予理會，他要做的事，毋須他人置喙。",
      },
      {
        type: "天",
        num: "032",
        cv: "趙嶺",
        hobby: "博文、書畫",
        origin:
          "【漢】司馬遷《史記·李斯列傳》》\n【漢】司馬遷《史記·秦始皇本紀》》\n【漢】佚名《趙正書》",
        impression:
          "彼時天下方爭之世，正是李斯一展抱負之時。讀過滿腹詩書，去國離鄉，尚未立不世之功，又怎甘於在《逐客令》下後，黯然離去？“不問可否，不論曲直……此非所以跨海內制諸侯之術也。”洋洋灑灑、字字珠璣，不僅令秦王回心轉意，也讓“李斯”這個名字在歷史上留下不可磨滅的痕跡。",
      },
      {
        type: "玄",
        num: "087",
        cv: "張琦",
        hobby: "賞玩、妝飾",
        origin: "【漢】司馬遷《史記·貨殖列傳》\n【漢】班固《漢書·貨殖傳》",
        impression:
          "巴清是一個和誰都能相處融洽的女人，孤傲如嬴政亦要敬其三分，驕狂如霍去病也不會對她無禮，恣意如李太白也不會對她放肆。她可謂忘川中的遊魚，左右逢源，縱然閻君親臨，也能談笑自如，順便在言笑之間說服閻君同意將五湖商社生意擴展到幽冥酆都。",
      },
    ],
  },
  {
    id: 3,
    dynasty: "西楚",
    avatar: [
      {
        type: "天",
        num: "023",
        cv: "劉飛",
        hobby: "雅宴、演武",
        origin: "【西漢】司馬遷《史記·項羽本紀》",
        impression:
          "距離垓下之戰兵敗、項羽烏江自刎，已經不知過了多少年，每年的此時，項羽都會提上兩壺好酒，來到忘川河邊，祭奠軍中的亡魂。世人提及西楚霸王，或是敬他威名蓋世、神勇無雙，或是歎他仁義愛人，卻英雄末路。可無人知道，成為名士不入輪回的他，背負著的是什麼。 在忘川的無數個日夜，項羽仍能時時聽見耳畔傳來楚歌，那或許是陣下軍士在渡過忘川河時發出的悲泣。",
      },
      {
        type: "地",
        num: "055",
        cv: "林簌",
        hobby: "樂舞、演武",
        origin: "【漢】司馬遷《史記·項羽本紀》",
        impression:
          "她是忘川絕世的劍舞者，美人如玉劍如虹。人人皆知虞姬對自己雙劍愛若珍寶，雙劍失竊，她便誓要將偷竊的小鬼粉身碎骨，縱然被人議論脾氣火爆，也決不甘休。因為只有虞姬自己知道，雙劍於她，早已不是尋常兵器那樣簡單。劍乃傷人利器，可對虞姬而言，劍，也是英雄之兵。她永不會忘記被人欺凌，只能以匕首自保的歲月。",
      },
    ],
  },
  {
    id: 4,
    dynasty: "漢",
    avatar: [
      {
        type: "天",
        num: "007",
        cv: "翟巍",
        hobby: "博文、弈棋",
        origin: "【漢】司馬遷《史記·留侯世家》\n漢】班固《漢書·張陳王周傳》",
        impression:
          "論及張良，忘川名士定會說：“謙謙君子，當如是。”出身韓國貴族，他的行動坐臥皆儒雅風流，不浴不冠不焚香必不見客，琴棋書畫樣樣精通，忘川雅士當屬他為先，然而他卻常常笑歎道：“不過是無用之學。”君子，渡天下，亦渡己。",
      },
      {
        type: "天",
        num: "011",
        cv: "倔強的小紅",
        hobby: "弈棋、演武",
        origin:
          "【漢】司馬遷《史記·淮陰侯列傳》\n【漢】司馬遷《史記·項羽本紀》\n【漢】司馬遷《史記·高祖本紀》",
        impression:
          "韓信統軍以來，定三秦，涉西河，虜魏王，擒夏說，又引兵下井陘，徇趙，脅燕，定齊，南摧楚人之兵二十萬，東殺龍且，西懾項羽，功無二於天下。韓信少有朋友，也很少需要朋友，或許兵書與象棋就是韓信心中的至樂之物了。",
      },
      {
        type: "天",
        num: "013",
        cv: "姜廣濤",
        hobby: "演武、樂舞",
        origin: "【西晉】陳壽《三國志·吳書·周瑜傳》",
        impression:
          "他是精雕細刻的無瑕美玉，藏諸笥櫝；是玉露澆灌的謙謙青松，養於庭階。周瑜生於官宦之家，如群星生於銀河，在天外俯瞰人世，無涉世間哀苦。公卿世族，庭訓規整，舉動必遵禮法；精研音律，言議英發，行止自是風雅。而朝廷式微，禍及門楣，奸臣當道，群雄紛起，誰還甘做一世舒城春柳下的顧曲少年？",
      },
      {
        type: "天",
        num: "014",
        cv: "蘇尚卿",
        hobby: "演武、弈棋",
        origin: "【西晉】陳壽《三國志·吳書·孫破虜討逆傳》（含裴松之注）",
        impression:
          "他誕生於烽火中，眼看父親一路披荊斬棘，從布衣躋身群雄，江東之虎的血脈令他自覺生來不凡。十七歲，父親身死，帶走這個家族短暫的繁華；十九歲，重整旗鼓，他在一片廢墟中開天闢地。他有每個少年都有的癡心狂想，也有其他少年沒有的不顧一切的勇氣。他生在亂世，就是為了當英雄的。",
      },
      {
        type: "天",
        num: "029",
        cv: "曹真",
        hobby: "食珍、演武",
        origin:
          "【漢】司馬遷《史記·衛將軍驃騎列傳》\n【漢】班固《漢書·衛青霍去病傳》",
        impression:
          "衛青來到忘川之後，依舊沒有改變舊日在軍中的習氣。每日卯時起，亥時休。無論是颳風下雨還是驕陽似火，他總是雷打不動地每日演武一個時辰，繞著金戈館跑馬一個時辰。忘川名士上街，總能看見衛大將軍騎著汗血寶馬的颯爽英姿。",
      },
      {
        type: "天",
        num: "033",
        cv: "梁達偉",
        hobby: "博文、演武",
        origin: "【漢】司馬遷《史記·孝武本紀》\n【漢】班固《漢書·武帝紀》",
        impression:
          "文景之治承平日久，生齒日繁，少年劉徹卻不因河清海晏的治世圖景而洋洋自得，始終希望有朝一日能夠建立一支鐵血部隊為大漢王朝解決邊患、開疆拓土。建元三年，漢軍出征閩越，開大漢揚威之先聲。歷經數十載戎馬征伐，攘四夷而廣土斥境，嶺南河套重歸中原版圖，河西四郡也成大漢鐵騎縱橫馳騁的疆土，唯見匈奴紛北卻，絲路連西東。",
      },
      {
        type: "天",
        num: "042",
        cv: "唐雅菁",
        hobby: "樂舞、書畫",
        origin:
          "【漢】班固《漢書·匈奴傳》\n【南朝宋】范曄《後漢書·南匈奴列傳》",
        impression:
          "當風雪覆蓋忘川，棠梨坊總會傳出琵琶的曲調。慢撚輕抹，恍若碎玉落瓷盤，那清冷掖庭寂寂深宮，那塞上蠻荒風沙覆面，都傾訴曲間，緩緩流淌。所有人都知道，那是王昭君又陷入了往事的回憶。",
      },
      {
        type: "天",
        num: "046",
        cv: "黑石稔",
        hobby: "食珍、賞玩",
        origin:
          "【漢】司馬遷《史記·大宛列傳》\n【漢】班固《漢書·張騫李廣利傳》",
        impression:
          "出隴西，通絕域，窮河源，晝與夜、光與影籠罩的西行之路，恰如張騫人生軌跡般，時有大起大落。他曾登至沙山之巔，目見莽莽平沙被風捲入天際，天地晝晦間向前伸出手掌，僅咫尺之距也無法相辨五指；他也曾從陡峭如削之坡跌入深谷，卻見大河水澤潛行地下，步步徐行逆流而去，尋至源頭只歎造化機巧。去路雖常不可見，但只要有漢節緊握於掌中，希望之火便會長燃在張騫心底。",
      },
      {
        type: "地",
        num: "052",
        cv: "唐小喜",
        hobby: "演武、妝飾",
        origin: "【西晉】陳壽《三國志·吳書·周瑜傳》",
        impression:
          "無論是幼時為自己紮髻時的柔聲細語，還是戰亂流離時緊緊攥住自己的手，抑或是每一件針腳細密、繡工精緻的衣裳……小喬總是能在日常的點滴瑣事中，窺見姐姐對自己的愛護。姐妹二人經逢亂世，飄搖凋零，卻又有幸於忘川重聚。九泉之井中，小喬再次牽住姐姐的手，往日烽煙又浮現眼前，那時的她在心底暗暗發誓：今後我一定要變強，保護好姐姐！",
      },
      {
        type: "地",
        num: "054",
        cv: "李正翔",
        hobby: "食珍、演武",
        origin:
          "【漢】司馬遷《史記·衛將軍驃騎列傳》\n【漢】班固《漢書·衛青霍去病傳》",
        impression:
          "霍去病是忘川的驕陽，無論誰見了他，都忍不住贊一句“好一個漢家兒郎！”他驕傲自負，遍數忘川，得他真心崇敬之人寥寥可數，他的舅舅衛青是其中之一。他是一匹不屈的驍狼，從前他的尖牙利爪為大漢而戰，而今，他願為忘川橫槍躍馬，萬死莫辭。",
      },
      {
        type: "地",
        num: "058",
        cv: "李世榮",
        hobby: "樂舞、妝飾",
        origin: "【漢】司馬遷《史記·外戚世家》\n【漢】班固《漢書·外戚傳上》",
        impression:
          "塵封的回憶裡，記載了那年秋天長安遍地的鮮血，衛子夫走過屍橫遍野的戰場，曳地的裙擺染上洗不淨的血污。誰能想像，一個柔弱如花的女人，竟然有膽量起兵反抗那莫須有的誣陷。可是，一切終難回首，帝王收回後璽的命令冷漠無情，三尺白綾，飄蕩的素色裙擺如頹敗的名花，她知道，唯有一死，才能自證清白。",
      },
      {
        type: "地",
        num: "062",
        cv: "閻萌萌",
        hobby: "妝飾、書畫",
        origin: "【晉】陳壽《三國志·吳書·周瑜傳》",
        impression:
          "皖縣雖小，卻有著小橋流水，翠樹生花，承載著大喬少女時期安穩平靜的生活。在父親的庇護下，大喬養成了溫柔嫻雅，知書達理的性子。她埋首於一針一線，詩文萬卷。閒暇時與妹妹笑談杏梨如雪，暢言閨中思緒。亂世之下，未經人間疾苦。她明白，能夠來到忘川，聽著妹妹的聲聲呼喚，作為平常人家的女子生活，做想做的事，見想見的人，這未嘗不是一種幸運。",
      },
      {
        type: "地",
        num: "068",
        cv: "賈邱",
        hobby: "雅宴、賞玩",
        origin: "【漢】司馬遷《史記·高祖本紀》\n【漢】班固《漢書·高帝紀》",
        impression:
          "劉邦是忘川帝王裡最不正經的一個，雖然部分名士對他的手段嗤之以鼻，但他在金戈館中卻是勝率最高的。劉邦的眼神多數時候和他的身形一樣懶散，只有想到哪些名士能助自己在忘川建立基業時，眼中偶爾閃過一道狡黠的精芒。劉邦沒有帝王包袱，為達目的何止不擇手段，原則道義都可拋諸腦後。",
      },
      {
        type: "地",
        num: "069",
        cv: "張安琪",
        hobby: "弈棋、賞玩",
        origin: "【漢】司馬遷《史記·呂太后本紀》\n【漢】班固《漢書·高後紀》",
        impression: "敬請期待。",
      },
      {
        type: "玄",
        num: "088",
        cv: "王曉彤",
        hobby: "博文、弈棋",
        origin: "【西漢】司馬遷《史記·絳侯周勃世家》《史記·外戚世家》",
        impression:
          "許負號稱是忘川最為神秘的名士之一。因為她一向不愛出門，大家都懷疑她有社交恐懼症。連袁天罡登門拜訪，都被一本無字天書打發了去。傳聞她精通蔔算，足不出戶，僅聞人聲，就蔔得出來訪者數十載的往事與前程。",
      },
      {
        type: "玄",
        num: "094",
        cv: "劉垚",
        hobby: "書畫、食珍",
        origin: "【漢】劉歆《西京雜記·卷二》",
        impression:
          "若非史籍白紙黑字的記載，忘川眾人無論如何也不願相信，毛延壽曾是西漢宮廷裡公認最有天賦的畫師。那雜亂的色塊、扭曲的形體、稚拙的筆觸，有人學習後世的辭彙，婉轉地稱之為“抽象派”，也有人不屑地嘲笑他是“鬼畫符”。可毛延壽從未想要改變他的畫風，精緻的線條勾勒不出他眼裡的世界：群山是會咆哮的，太陽是會融化的，黑夜是會吃人的…",
      },
      {
        type: "地",
        num: "106",
        cv: "張若瑜",
        hobby: "賞玩、妝飾",
        origin: "【漢】班固《漢書》\n【宋】司馬光《資治通鑒》",
        impression:
          "漢家宮闕在西風殘照中漸漸遠去，走進烏孫國的那一刻，解憂才發現這裡並不像她想像中那般荒蠻。連天的草浪、成群的牛羊，這些殊異於中原的景色，在漫漫歲月中，漸漸融入她的骨血。於是她下定決心，除卻要肩負起大漢公主的使命，亦要助烏孫擺脫匈奴襲擾。解憂解憂，她定要窮盡此生，解兩國百姓之憂。",
      },
    ],
  },
  {
    id: 5,
    dynasty: "三國",
    avatar: [
      {
        type: "天",
        num: "026",
        cv: "錢文青",
        hobby: "演武、品茗",
        origin: "【西晉】陳壽《三國志·蜀書·趙雲傳》（含裴松之注）",
        impression:
          "《三國演義》一時風靡忘川，茶樓酒肆裡，人人都可說上一段“一呂二趙三典韋”。歷史上，趙雲曾於長阪坡萬人中護下主公的妻兒；傳說裡，趙雲是未嘗一敗的常勝將軍。據說趙雲每次出門，撿到錢是家常便飯，購物免單、就餐贈飲、猜謎都對……坊間把趙雲的強運傳得越發玄乎，他只能哭笑不得地多次澄清。",
      },
      {
        type: "天",
        num: "031",
        cv: "徐翔",
        hobby: "雅宴、博文",
        origin:
          "【晉】陳壽《三國志·魏書·任城陳蕭王傳》\n【黃傑】《曹子建詩注》",
        impression: "敬請期待",
      },
      {
        type: "地",
        num: "056",
        cv: "黃翔宇",
        hobby: "博文、弈棋",
        origin:
          "【晉】陳壽《三國志·魏書·文帝紀》\n【宋】司馬光《資治通鑒·魏紀》",
        impression: "敬請期待",
      },
      {
        type: "地",
        num: "064",
        cv: "劉垚",
        hobby: "雅宴、樂舞",
        origin: "【唐】房玄齡等《晉書·列傳第十九》\n【高晨陽】《阮籍評傳》",
        impression:
          "他阮籍是忘川唯一可以與李白鬥酒之人，他的酒囊永遠不離身，朝飲三百杯，醉至明朝醒。有一回，忘川使者在自己家的屋頂上發現了大醉的阮籍，待他醒來才知——“使君屋頂賞日落尤美，飲酒無度，醉不自知，失禮失禮。”忘川澄明如洗，雖地處幽冥，卻有繁花盛景。他的長嘯、他的詠歎、他的暢飲，終於沒有了憂愁的苦味。有此歸宿，亦不枉餘生。",
      },
      {
        type: "地",
        num: "065",
        cv: "戴超行",
        hobby: "雅宴、樂舞",
        origin:
          "【唐】房玄齡等《晉書·列傳第十九》\n【清】嚴可均《全晉文·卷六十五》",
        impression: "敬請期待",
      },
      {
        type: "地",
        num: "077",
        cv: "陶典",
        hobby: "賞玩、妝飾",
        origin: "【三國】魚豢《魏略·卷三》\n【宋】司馬光《資治通鑒·魏紀》",
        impression: "敬請期待",
      },
    ],
  },
  {
    id: 6,
    dynasty: "晉",
    avatar: [
      {
        type: "天",
        num: "010",
        cv: "趙銘洲",
        hobby: "博文、雅宴",
        origin:
          "【南朝宋】顏延之《陶征士誄》\n【南梁】沈約《宋書·隱逸·陶潛傳》\n【南梁】蕭統《陶淵明傳》\n【唐】房玄齡等《晉書·隱逸·陶潛傳》\n【唐】李延壽《南史·隱逸上·陶潛傳》",
        impression:
          "《比起豪宅闊庭，陶淵明更喜居於平曠田野、樹木環繞的屋舍之中。他在忘川擁有一大片田園，養育諸多小動物，常有排排小鴨子，叼著雛菊緊跟在陶淵明身後，隨他田野漫步。陶淵明喜歡荊軻種滿藥草的庭院，喜歡交流耕種心得，他也喜歡釀酒，釀出的酒廣受忘川愛酒名士的好評。常有名士挈壺相與至陶淵明所居的鄉野田園，乾草鋪地，舉觴對飲於松樹之下。",
      },
      {
        type: "天",
        num: "030",
        cv: "吳韜",
        hobby: "演武、食珍",
        origin: "【唐】房玄齡等《晉書·謝玄傳》",
        impression:
          "陳郡謝氏，恰如世人所言，文載魏晉風流，武如寒劍出鞘。謝氏公子出身讓他一舉一動都溫雅如玉，談吐言辭皆清皎雋逸。“芝蘭玉樹”一詞，是對他最好的形容，亦是他用一生履行的對謝安許下的諾言。有人曾問，芝蘭玉樹與其生長的階庭，孰為因果？在謝玄眼中，這已無意義，無愧於心亦無愧於家，才是最有意義的事。",
      },
      {
        type: "地",
        num: "059",
        cv: "陳光",
        hobby: "書畫、賞玩",
        origin:
          "【唐】房玄齡等《晉書·列傳第五十》\n【唐】張彥遠《法書要錄·卷一》",
        impression:
          "王羲之是當之無愧的世家貴公子，其行其止，盡得世家風流。與大多數忘川名士不同，他的人生可謂順風順水，沒有風霜撲面，也沒有坎坷流離。他生在世家大族，年輕時被選為郗家東床快婿，婚後和樂美滿，兒孫滿堂，一世安康無憂。也因此，他的眸中永遠清亮如月，仿佛沒有半點陰霾。與他相處從不必費什麼心力，忘川名士皆喜與他交遊。",
      },
      {
        type: "地",
        num: "072",
        cv: "賀文瀟",
        hobby: "博文、賞玩",
        origin:
          "【唐】房玄齡等《晉書·王凝之妻謝氏傳》\n【唐】房玄齡等《晉書·王羲之子凝之傳》",
        impression:
          "東山之美，在於雲蒸霞蔚，亦在高山流水。謝道韞少時聰慧，隨叔父隱居東山，賞景對詩，一問一答，練就能言善辯的好本領，更有詠雪之句流傳後世。彼時一門子弟，言笑晏晏，受叔父薰陶，心在家國天下，意在山水之間。她生在謝家門庭，也曾希冀，自己的人生，就和當年的謝氏一般如日方升。",
      },
      {
        type: "玄",
        num: "080",
        cv: "喵醬",
        hobby: "食珍、妝飾",
        origin: "【唐】歐陽詢《藝文類聚·雜文部二》",
        impression:
          "楊容姬始終記得，與潘安花下初遇的時光。也從不曾忘記，從前的自己，是如何在夫君的鼓勵下，嘗試從前不敢嘗試的事情。究竟從何時起，一切都變了？她開始在乎世人的評價，開始被所謂的好妻子標準束縛。來到忘川，明明潘安近在咫尺，她卻不敢相認，唯有以樂曲抒發心中鬱結，為他做的桃酥早已堆滿後廚，卻無人能品嘗，唯有一碟一碟倒入水渠。",
      },
      {
        type: "玄",
        num: "083",
        cv: "錢文青",
        hobby: "博文、妝飾",
        origin:
          "【唐】房玄齡等《晉書·列傳第二十五》\n【南朝宋】劉義慶《世說新語·容止》",
        impression: "敬請期待",
      },
      {
        type: "玄",
        num: "084",
        cv: "李郝瑞",
        hobby: "博文、賞玩",
        origin:
          "【唐】房玄齡等《晉書·列傳第三》\n【明】王世貞《豔異編·戚裡部二》",
        impression: "敬請期待",
      },
      {
        type: "玄",
        num: "085",
        cv: "徐慧",
        hobby: "雅宴、樂舞",
        origin:
          "【唐】房玄齡等《晉書·列傳第三》\n【明】王世貞《豔異編·戚裡部二》",
        impression:
          "有誰聽過金穀園清晨的笛聲？婉轉纏綿，繞梁三日。那些燈火喧囂，歌舞昇平的夜晚結束後，綠珠總會在高樓上，倚著欄杆吹響玉笛。她曾是白州境內綠蘿村裡的貧苦少女，卻因十斛珍珠得到新生。高樓之上，綠羅裙如落花飄零，這便是藤蔓的選擇。",
      },
    ],
  },
  {
    id: 7,
    dynasty: "南北朝",
    avatar: [
      {
        type: "天",
        num: "005",
        cv: "李蘭陵",
        hobby: "演武、樂舞",
        origin:
          "【唐】李百藥《北齊書·文襄六王·蘭陵王傳》\n【北齊】佚名《齊故假黃鉞太師太尉公蘭陵忠武王碑》",
        impression:
          "高長恭對於童年最深刻的記憶，是武定七年父親的猝然離世。他還未回過神來，二叔已經在萬眾矚目之下將河山改名換姓，從此他成了文襄皇子。他聽著二叔的顯赫戰績長大，聽見人們為他高呼 “英雄天子”，也曾隨他站在鄴城三台之上俯瞰山河，深切地體會到這是高家的江山，是他要守護的天下。",
      },
      {
        type: "天",
        num: "022",
        cv: "馬正陽",
        hobby: "博文、樂舞",
        origin: "【唐】李大師、李延壽等《南史》\n【唐】魏征等《隋書》",
        impression:
          "祖沖之自小便專攻數術，稽古慎思。在他眼中，日月星辰之運轉是謎題，機關術數之推演是謎題，古人算而未盡之數是謎題，就連山中野狐、樹下精怪也使他好奇。為了探究這些，他每每親量圭尺，躬察儀漏，目盡毫釐，心窮籌策。他的苦心亦沒有東流，書成《大明曆》，精確圓周率，計算“交點月”，重造指南車。儘管他的許多著作在後世散軼，可他的成就依然在歷史中熠熠生輝。",
      },
    ],
  },
  {
    id: 8,
    dynasty: "唐",
    avatar: [
      {
        type: "天",
        num: "004",
        cv: "趙路",
        hobby: "雅宴、博文",
        origin:
          "【後晉】劉昫等《舊唐書·文苑傳》\n【宋】宋祁、歐陽修等《新唐書·文藝傳》",
        impression:
          "李白是忘川的探險家，他致力於揭秘廣大的忘川幽冥，踏遍每一寸忘川淨土。他的蹤跡無處可尋，有時能看見他在河中扁舟破浪，亂髮當風，有時又見他在三世樓頂且歌且吟，舉杯邀月。他醉中寫下的詩篇散落忘川，連奈何橋下都漂過他的絕句。曾有名士言：“謫仙狂士，當是如此。",
      },
      {
        type: "天",
        num: "006",
        cv: "黑石稔",
        hobby: "博文、品茗",
        origin:
          "【唐】慧立撰，彥悰箋《大慈恩寺三藏法師傳》\n【唐】玄奘述，辯機撰《大唐西域記》",
        impression:
          "玄奘其人，身強力壯，孔武有力，一反話本中文弱聖僧形象。來至忘川後，玄奘一如在世時光，每日三更歇息，五更複起，誦經念佛，習武打坐，行遊四方，無棄寸陰。有好事之徒見玄奘之行，心覺甚苦，以“何必”相問，玄奘只言：“貧僧既已手執此刻光陰，則理應珍惜。",
      },
      {
        type: "天",
        num: "034",
        cv: "黃鶯",
        hobby: "弈棋、賞玩",
        origin:
          "【後晉】劉昫等《舊唐書·則天皇后本紀》\n【宋】宋祁、歐陽修等《新唐書·則天皇后本紀》",
        impression:
          "上陽宮的煙雨還未停歇，一代鏗鏘紅顏，已經落幕。她做過才人，進過感業寺為尼。她當過昭儀，也當過皇后，甚至天后，臨朝聽政，號令百官。可這遠遠不夠，為後，終究是男人的附庸，唯有稱皇，才能成就真正的她。她不要做深宮裡的妃子，她要成為天下共主，神都至尊。前承貞觀，後啟開元，她是第一個女皇。",
      },
      {
        type: "天",
        num: "035",
        cv: "孫嗶",
        hobby: "演武、書畫",
        origin:
          "【後晉】劉昫等《舊唐書·太宗本紀》\n【宋】宋祁、歐陽修等《新唐書·太宗本紀》",
        impression:
          "比起嬴政、曹丕，李世民倒不像是一個帝王，更像是一個住在尋常巷閭的鄰家公子。他的身上沒有不近人情的疏離與隔閡之感，反倒平易近人，和善可親。有不識他身份的過路小鬼上門討飯，或有其他名士過府叨擾，他都一一微笑著滿足所求，從不拒絕。",
      },
      {
        type: "天",
        num: "041",
        cv: "楊夢露",
        hobby: "樂舞、妝飾",
        origin:
          "【後晉】劉昫等《舊唐書·玄宗本紀》\n【宋】宋祁、歐陽修等《新唐書·后妃上》",
        impression:
          "她還記得那年長生殿密約盟誓，結發共攜手，長久不分離。她也記得梨園鼓聲不停，她的舞姿宛如翾風回雪，恍若飛燕遊龍。若他們是凡俗夫妻，風花烹作茶，雪月釀成酒，歲歲年年朝夕相伴，或許一切都會不同。可人事畢竟不盡如人意，是帝王夫妻，國家安危禍福便俱系於一身。幸好，他仍會為她拂落鬢間霜雪，告訴她：“別怕，我在。",
      },
      {
        type: "地",
        num: "049",
        cv: "陳奕雯",
        hobby: "博文、妝飾",
        origin:
          "【後晉】劉昫等《舊唐書·后妃上》\n【宋】宋祁、歐陽修等《新唐書·后妃上》",
        impression:
          "年少的上官婉兒從未想過要當“巾幗宰相”。那時的她是掖庭低微的罪奴，偷偷看著史書，忍不住常常去想：命運是什麼？命運是雄主受命於天？命運是英才造於時勢？——命運，是掖庭罪奴生來卑賤庸碌？她讀過許多書，也未能找到答案——直到見到武後。那個女人睥睨著她，喜怒不辨，帶著令天下臣服的威勢，連天子也莫敢攖其鋒芒。上官婉兒終於頓悟，命運，並非生來如何，而是如何選擇。",
      },
      {
        type: "地",
        num: "050",
        cv: "蔣麗",
        hobby: "食珍、妝飾",
        origin:
          "【後晉】劉昫等《舊唐書·外戚傳》\n【宋】宋祁、歐陽修等《新唐書·諸帝公主傳》",
        impression:
          "太平公主在雲譎波詭的宦海中沉沉浮浮，掙扎於朝堂上的腥風血雨，爾虞我詐。她成了權傾天下的“鎮國太平公主”，距離母親曾經的位置不過一步之遙，而曾經與她牽手在宮闈中蹴鞠奔跑的人，與她並肩在權謀中共同進退的人，與她約定一起掙脫既定命運的人，卻早已音容不再。世間再無人知她為何而爭，也再無人伴她走向茫茫前路。",
      },
      {
        type: "地",
        num: "053",
        cv: "劉北辰",
        hobby: "樂舞、弈棋",
        origin:
          "【後晉】劉昫等《舊唐書·玄宗本紀》\n【宋】宋祁、歐陽修等《新唐書·玄宗本紀》",
        impression: "敬請期待。",
      },
      {
        type: "地",
        num: "061",
        cv: "李嬋妃",
        hobby: "樂舞、妝飾",
        origin: "【唐】杜甫《觀公孫大娘弟子舞劍器行序》",
        impression:
          "來如雷霆收震怒，罷如江海凝清光”，杜甫為公孫大娘的弟子留下膾炙人口、流傳至今的詩句，讓人們記住了那個極盡繁華的盛世大唐中的一抹亮色。她一盤劍，一撩劍，似乎都能帶動整個大唐的眼光，她挽起的劍花，也輝映著盛唐燈火的光芒。或許最重要的已不是技藝，而是整個王朝的氣韻。",
      },
      {
        type: "地",
        num: "066",
        cv: "蔣可",
        hobby: "品茗、博文",
        origin:
          "【後晉】劉昫等《舊唐書·文苑傳》\n【宋】宋祁、歐陽修等《新唐書·文藝傳》",
        impression: "敬請期待。",
      },
      {
        type: "地",
        num: "070",
        cv: "羅玉婷",
        hobby: "賞玩、妝飾",
        origin: "【宋】孫光憲《北夢瑣言·卷九》\n【元】辛文房《唐才子傳·卷八》",
        impression: "敬請期待。",
      },
      {
        type: "玄",
        num: "079",
        cv: "吳迪",
        hobby: "品茗、賞玩",
        origin: "【後晉】劉昫等《舊唐書·列傳第二十九》",
        impression:
          "每到繁星滿天，鐘鼓未歇的夜晚，忘川最高的閣樓上，總會出現一個小小的剪影，晃蕩著雙腿，嘴裡念念有詞——“一顆星，兩顆星，滿天都是小星星……”，那是後世傳說的大唐太史令李淳風，他能知曉天文地理，亦能推測古今之事。",
      },
      {
        type: "玄",
        num: "081",
        cv: "周帥",
        hobby: "食珍、演武",
        origin:
          "【後晉】劉昫等《舊唐書·列傳第八》\n【宋】宋祁、歐陽修等《新唐書·諸帝公主傳》",
        impression: "敬請期待。",
      },
      {
        type: "玄",
        num: "086",
        cv: "劉以嘉",
        hobby: "博文、賞玩",
        origin:
          "【唐】吳兢《貞觀政要·任賢》\n【宋】宋祁、歐陽修等《新唐書·列傳第二十二》\n【宋】司馬光《資治通鑒·唐紀》",
        impression: "敬請期待。",
      },
      {
        type: "玄",
        num: "092",
        cv: "高其昌",
        hobby: "品茗、弈棋",
        origin: "【宋】宋祁、歐陽修等《新唐書·方技傳》",
        impression:
          "凡世流傳袁天罡實為隋朝皇室血脈，武周代唐其實出自他的手筆。袁天罡對此很難一笑置之，自打學相術起，袁天罡就信奉國家興衰和生老病死一樣，是不可扭轉的自然規律。但這個不可言說的身世，卻讓那個路不拾遺、夜不閉戶的長安城，成了困他半生的牢籠。",
      },
      {
        type: "玄",
        num: "095",
        cv: "王肖兵",
        hobby: "品茗、食珍",
        origin: "【宋】宋祁、歐陽修等《新唐書·隱逸傳》",
        impression:
          "名士進入忘川時，可以選擇保持任意年齡的外貌，名士們往往要求留下自己風華正茂的一面，獨獨孫思邈要以自己離開凡世時百歲高齡的形象示人。孫思邈一生鑽研醫術、鍾愛養生，長壽是他的驕傲，也是他舉世無雙的醫術和養生之道最好的證明。醫者仁心，孫思邈最大的願望，便是人人無病，為此也常與人分享自己的養生之道。",
      },
      {
        type: "玄",
        num: "096",
        cv: "白雪岑",
        hobby: "樂舞、演武",
        origin: "【唐】杜光庭《虯髯客傳》",
        impression:
          "能結交紅拂女，在忘川是一件值得吹噓的事。雖然她滿天下的知交裡，既有販夫走卒，也有帝王將相，但唯有各界最優秀的人才能得紅拂女青眼。成為紅拂女的朋友，就如同金榜題名，是忘川居民能力優秀的標誌。",
      },
    ],
  },
  {
    id: 9,
    dynasty: "五代",
    avatar: [
      {
        type: "玄",
        num: "091",
        cv: "申秋香",
        hobby: "樂舞、妝飾",
        origin:
          "【宋】陸游《南唐書·后妃諸王列傳》\n【宋】馬令《南唐書·女憲傳》\n【南唐】李煜《昭惠周后誄》",
        impression:
          "大周后生於官宦之家，通曉書史，聰慧美麗。她有著出眾的音樂才華，嘗於夜宴中即席譜成新曲，也曾一曲琵琶驚動四座。知曉大限將至之時，她沉靜從容地沐浴妝扮，向曾深愛的夫君告別。到了忘川，大周后也仍然常常撫起陪伴她已久的燒槽琵琶，任憑樂音飄散在廊下風中，帶著幾許若隱若現的惆悵。",
      },
    ],
  },
  {
    id: 10,
    dynasty: "宋",
    avatar: [
      {
        type: "天",
        num: "008",
        cv: "楊天翔",
        hobby: "演武、博文",
        origin: "【元】脫脫等《宋史·辛棄疾傳》\n【【宋】范開《稼軒詞序》",
        impression:
          "稼軒其人，姿英偉，尚氣節，心性狂傲，義形於色。北方山巒高聳，原野遼闊，辛棄疾年少時常仗劍禦馬，馳走於其間，有遊俠風范。只是形似遊，心存志，他的目光盯著敵人的城池關隘，也望著遠方的大宋朝堂。起義的旌旗揚起，辛棄疾暫棄詩書，提劍跨騎，吹響反抗的號角。只是仕途轉徙不定，朝堂攻訐不息，欲了卻君王天下事，卻只得臨湖望風月，著詞抒胸臆。",
      },
      {
        type: "天",
        num: "012",
        cv: "常文濤",
        hobby: "博文、雅宴",
        origin: "【元】脫脫等《宋史·歐陽修傳》\n【北宋】歐陽修《歐陽文忠集》",
        impression:
          "在洛陽幕下，他結交當時名士，精進文學；在朝廷中樞，他直言進諫，聲援被讒言攻擊的重臣，不惜為此被貶離京。晚年，歐陽修更是深諳進退之道，早早歸居潁州。平山堂下，醉翁亭前，潁州水畔，他經行之處，自存千古風流。",
      },
      {
        type: "天",
        num: "017",
        cv: "常文濤",
        hobby: "演武、食珍",
        origin: "【元】脫脫等《宋史·太祖本紀》\n【宋】司馬光《資治通鑒》",
        impression:
          "趙匡胤其人，騎射武功彰氣度，一身俠氣作肝膽。天下難事，似乎沒有他不敢嘗試的。只憑一身熱血，馴烈馬，遊四方，投軍旅。高平戰場上，他在指揮逃逸時繼續率軍衝鋒；征伐淮南時，也於千軍之中手刃首領。然而戰功赫赫，豈憑一腔熱血？他胸中自有丘壑，觥籌交錯之際與趙普議定緩攻太原，帝王本色一展無遺。",
      },
      {
        type: "天",
        num: "018",
        cv: "小連殺",
        hobby: "博文、賞玩",
        origin: "【宋】李清照《金石錄後序》\n【宋】趙彥衛《雲麓漫鈔》卷十四",
        impression:
          "李清照號稱婉約派“詞宗”，不僅一杆妙筆寫盡世事跌宕、歲月滄桑，也愛好品評歷代文學大家，曾作《詞論》評議北宋詞壇。李清照才高氣傲，嘴下更不容情，時常與名士們爭得面紅耳赤，不過隔日又見他們一處共飲。眾名士皆知易安居士性情直爽，而對待學問更是一絲不苟，無不敬她三分。",
      },
      {
        type: "天",
        num: "025",
        cv: "白雪岑",
        hobby: "演武、樂舞",
        origin:
          "【元】脫脫、阿魯圖等《宋史·韓世忠傳》\n【南宋】李心傳《建炎以來系年要錄》",
        impression:
          "梁紅玉把端莊有禮拿捏得宛如天生，舉手投足盡顯風度貴氣，人人皆誇她擔得起這誥命封賞。可是她自己明白，名利場中浮華浸潤，官場宦海沉浮，派系之間藏著多少明爭暗鬥。她只有成為一個舉手投足都無可挑剔的誥命夫人才能堵住官帽下的悠悠之口，才有機會實現想要手刃侵略敵軍、北上收復失地的主張。她那被人人羨慕的端莊舉止背後，是一個官場中人隱忍克制的辛酸。",
      },
      {
        type: "天",
        num: "036",
        cv: "馬正陽",
        hobby: "博文、品茗",
        origin: "【南宋】葉紹翁《四朝聞見錄》\n【元】脫脫等《宋史》",
        impression:
          "陸游總把自己裹得嚴實，踏著雪，尋最紅的一枝梅。有時貓兒在他腳邊撒嬌，他便抱起貓兒一同出門，慢慢向它講述梅的好處：“無意苦爭春，一任群芳妒。零落成泥碾作塵，只有香如故。”陸游或許在說梅，又或許在說自己。貓兒不懂，只是從他的懷裡伸出爪子，輕觸枝頭紅梅。",
      },
      {
        type: "天",
        num: "040",
        cv: "李卓霆",
        hobby: "博文、品茗",
        origin:
          "【北宋】王安石《臨川集》\n【元】脫脫等《宋史·王安石傳》\n【近代】梁啟超《王安石傳》",
        impression:
          "初入仕途，他推辭入京，輾轉四方，改善民生，初悟新法雛形。彼時一腔熱血，堅信事在人為，終可大展宏圖。直到變法挑起各方紛爭，他與世人背行。面對口誅筆伐之勢，舊友離心之摧，他安如磐石，不曾回首。“新法誤國，千古罪人……”變法失敗，批判之詞聲聲入耳。然而後人褒貶，於他如浮雲。浮雲不曾遮蔽他的目光，他的目光永遠向前。",
      },
      {
        type: "天",
        num: "044",
        cv: "楊夢露",
        hobby: "樂舞、弈棋",
        origin:
          "【元】《宋史·章獻明肅劉皇后傳》脫脫等\n【元】《宋史·呂夷簡傳》脫脫等",
        impression:
          "繈褓而孤，或許也等同於無所牽掛，故而劉娥這一路走得順遂暢快，管它百步幾折，先將山歌唱起。歌兒飄到哪去？自己又能行到哪去？劉娥還沒想得十分明白，就已經站在了汴梁街頭。蜀地歌聲多沁人，叫好的觀眾怎耐得她把問題想完？這不，撥浪鼓的小槌還沒完全停穩，掌聲卻已如潮水般把劉娥捧上天去，就像初升的月牙，而後冉冉向上……",
      },
      {
        type: "地",
        num: "048",
        cv: "沈磊",
        hobby: "博文、食珍",
        origin: "【元】脫脫等《宋史·蘇軾傳》\n【宋】蘇轍《東坡先生墓誌銘》",
        impression:
          "要數忘川勝境，得票最多的不是煙雨濛濛三世樓，也不是星河璀璨忘川河，而是酒肉飄香饕餮居。而這饕餮居的第一大廚，當推眉山蘇東坡。每次他開灶掌勺，饕餮居定然人滿為患，從庭院到階梯都坐滿了人。東坡二紅飯、東坡五柳魚，東坡蔓箐羹……食之無怪乎名士流連忘返不思歸。",
      },
      {
        type: "地",
        num: "067",
        cv: "趙毅",
        hobby: "品茗、樂舞",
        origin: "【宋】黃庭堅《小山詞序》\n【清】陳廷焯《詞壇叢話》",
        impression:
          "晏幾道飲食精細，注重食材本身的鮮味，因此不喜歡蘇軾重油重辣的烹飪風格，相反對柳如是所制的清雅小點大加讚賞。有好事名士猜測二人可能有什麼過節，畢竟晏幾道往世就曾給蘇軾吃過閉門羹。可晏幾道卻回答自己只是就事論事，蘇軾本人也一笑置之，只說“叔原是性情中人”",
      },
      {
        type: "地",
        num: "071",
        cv: "申秋香",
        hobby: "妝飾、樂舞",
        origin: "【宋】孟元老《東京夢華錄·卷五》\n【宋】張端義《貴耳集·卷下》",
        impression:
          "敬請李師師在人世時，是令百花無顏色，一曲動帝王的汴京名姝。來到忘川，她擔任棠梨坊的教習，指導名士們歌舞的技巧，卻再不登台獻藝。李師師自問，若曾經歌舞是被人賞玩，重獲自由，如何不隨心逐願？有幸重生，李師師要作忘川最自由的鳥。期待。",
      },
      {
        type: "玄",
        num: "082",
        cv: "周帥",
        hobby: "品茗、食珍",
        origin: "【宋】釋惠洪《禪林僧寶傳》\n【宋】惟白《建中靖國續燈錄》",
        impression:
          "佛印嘴上功夫了得，任他人嬉笑怒罵，均能從容應對。與蘇軾互為“損友”，東坡喚“禿驢”，佛印便回“吃草”，一應一答，皆成忘川名士飯後笑談。有人歎：“如此相處，何苦何苦？”佛印笑答：“非也非也，此乃人生之趣！",
      },
      {
        type: "玄",
        num: "090",
        cv: "秦且歌",
        hobby: "品茗、演武",
        origin: "【元】脫脫等《宋史·列傳第四十九》",
        impression:
          "敬請狄青寒微之時，曾在面上刺字。功成名顯之後，宋仁宗也曾想幫狄青去除臉上的刺字。但這個字，象徵著狄青的出身、記錄著狄青這一路走來的艱難，狄青想要留住它，留住自己的過去。甚至到了忘川，狄青也只將臉上的字改成“武”字，這樣才符合他“面涅將軍”的綽號。期待。",
      },
    ],
  },
  {
    id: 11,
    dynasty: "元",
    avatar: [
      {
        type: "天",
        num: "015",
        cv: "樂小彤",
        hobby: "食珍、妝飾",
        origin: "【元】陶宗儀《南村輟耕錄》卷二十四\n【元】王逢《梧溪集》卷三",
        impression:
          "宋朝末年，人間政局風起雲湧，籠罩著松江烏泥涇旁的一架手搖紡車。年少的黃道婆尚未得知，自己彼時的人生正如一卷易斷的紗——所有災難都能扯毀，所有戰火都能點燃。迫不得已的流落如一陣疾風，載著黃道婆和手裡的紗線一塊兒坐上帆舟，又一塊兒靠了岸。當改朝換代的兵戈聲在她寄居的海角天涯暫息後，黃道婆走向岸灘，遙望遠方被映紅的天空。生命如紗線，易毀易燃，卻也能堅韌地編織到一處去，成為布匹。",
      },
      {
        type: "地",
        num: "060",
        cv: "蟲蟲",
        hobby: "書畫、賞玩",
        origin: "【元】趙孟頫《魏國夫人管氏墓誌銘》",
        impression:
          "閨門中的修行，尤重德容言功，而趙孟頫卻會牽著她的手，帶她做些書畫辭賦。操持家計之餘，更有撫琴清歌和泛舟酌酒。年輕時看著筆端流淌出晴竹和墨蘭，恍惚會覺得這一切都像是未醒的好夢。共執手寫畫的山水和蘭竹寸縷含情，而這樣的畫，他們還可以一起畫許多許多。",
      },
      {
        type: "地",
        num: "076",
        cv: "張沛",
        hobby: "書畫、賞玩",
        origin:
          "【明】宋濂等《元史·趙孟頫傳》\n【近代】柯劭忞《新元史·趙孟頫傳》",
        impression:
          "趙孟頫自出吳興，耳畔便常縈杜宇。然而賦遍歸去，百羨鷗鷺，人世間終究還是有那麼多的身不由己。偶爾偷閒提筆，畫中人會罷西園雅集，複聽取東山絲竹，悠然閑逸。而自己一旦擱筆，便又要赴召入朝，役役勞生，百般牽系。有時信筆描畫神駿良駒，竟會對那些漫步林間，悠然飲水的馬兒生出些許妒忌。",
      },
    ],
  },
  {
    id: 12,
    dynasty: "明",
    avatar: [
      {
        type: "天",
        num: "019",
        cv: "林景",
        hobby: "博文、食珍",
        origin:
          "【明】宋應昇《方玉堂全集》\n【明】宋應星《天工開物》\n【當代】潘吉星《宋應星評傳》",
        impression:
          "無論提問的人是誰，宋應星總是不厭其煩地為每個向他詢問的人細緻地答疑解惑。編撰《天工開物》，讓他對各行各業都有較深的涉獵，因此成為了忘川中的“萬事通”。每當有人稱讚他涉學深廣之時，他總是露出謙遜靦腆的笑容來：“宋某不過總前人之學，集各業之技而已，不敢擔得虛名。”",
      },
      {
        type: "天",
        num: "024",
        cv: "劉飛",
        hobby: "賞玩、食珍",
        origin:
          "【清】張廷玉等《明史·鄭和傳》\n【明】袁忠徹《古今識鑒》\n【明】佚名《非幻庵香火聖像記》",
        impression:
          "化形在忘川的小精怪們，向來只聽說過評書話本中翹著蘭花指、捏著嗓子細聲細氣的宦官。初見鄭和，卻是身長七尺，腰大十圍，行如虎步，聲如洪鐘，端的威風凜凜，還會不時和名士們過上幾招，令小精怪們嘖嘖稱奇。鄭和對別人的好奇向來不以為冒犯，他見過航行數十日不著邊際的汪洋、不辨天日的茂密雨林和中土未有的珍禽異獸，世間之樂，在於意出望外。",
      },
      {
        type: "天",
        num: "028",
        cv: "陳光",
        hobby: "書畫、賞玩",
        origin: "【明】祝允明《唐子畏墓誌並銘》\n【清】張廷玉等《明史·唐寅傳》",
        impression:
          "唐寅才結諸友，文驚四座，書畫雙全，童髻中科。然而快意少年時光止於弘治七年，父母妻妹相繼離世，家道衰落，他未到而立已生華髮。他也曾忍耐悲苦潛心科舉，身中解元，卻又捲入舞弊案而無緣仕途。他放縱於酒色間，暫忘卻人間多艱。",
      },
      {
        type: "天",
        num: "039",
        cv: "王宇航",
        hobby: "博文、演武",
        origin: "【明】于謙《於忠肅集》\n【清】張廷玉等《明史·于謙傳》",
        impression:
          "清風兩袖朝天去，免得閭閻話短長”，這是于謙對百姓的承諾，並用一生的光陰去踐行。正統年間，宦官王振一手遮天，貪贓枉法。有僚佐規勸于謙，縱無金銀玉石，也該有地方土產向王振打點一二。孰料于謙淡然一笑，瀟灑拂袖，以身上所餘唯有“清風”答之。",
      },
      {
        type: "天",
        num: "043",
        cv: "秦且歌",
        hobby: "博文、品茗",
        origin: "【明】鄒迪光《臨川湯先生傳》\n【清】張廷玉等《明史·湯顯祖傳》",
        impression:
          "臨川四夢”中，除了有奇絕靈動的情節和清麗脫俗的文字外，更有無處不在，婉轉秾麗的至情。他筆下的情，可以分善惡、超生死。他溫和冷靜地注視著世人，品他身之悅，察眾生之苦，集天地至情。",
      },
      {
        type: "天",
        num: "045",
        cv: "賈邱",
        hobby: "演武、博文",
        origin:
          "【明】朱元璋《朱氏世德碑記》\n【明】朱元璋《禦制皇陵碑》\n【清】張廷玉等《明史·本紀》卷一",
        impression:
          "詩狂酒癖總休論，病裡時時晝掩門。最是一生淒絕處，鴛鴦塚家欲招魂。”清廉為民的馮縣令也曾寫下過這樣繾綣的詩句。壽寧百姓……不知眼下生活如何，而戴清亭冬月的梅香可還依舊？他也曾在忘川翻閱後人對他的評價：政簡刑清，首尚文學，遇民以恩，待士有禮。傳志中寥寥數字，便凝練了他仕途一生。或許只有小翁看到，彼時燈下的馮夢龍，那微微勾起的嘴角。",
      },
      {
        type: "地",
        num: "073",
        cv: "王寧",
        hobby: "博文、賞玩",
        origin:
          "【明】馮夢龍《壽寧待志》\n【清】《江南通志》·卷一六五\n【清】《福寧府志》·卷十七",
        impression:
          "詩狂酒癖總休論，病裡時時晝掩門。最是一生淒絕處，鴛鴦塚家欲招魂。”清廉為民的馮縣令也曾寫下過這樣繾綣的詩句。壽寧百姓……不知眼下生活如何，而戴清亭冬月的梅香可還依舊？他也曾在忘川翻閱後人對他的評價：政簡刑清，首尚文學，遇民以恩，待士有禮。傳志中寥寥數字，便凝練了他仕途一生。或許只有小翁看到，彼時燈下的馮夢龍，那微微勾起的嘴角。",
      },
      {
        type: "地",
        num: "078",
        cv: "陈玺月",
        hobby: "賞玩、博文",
        origin: "【清】張廷玉等《明史·后妃傳》",
        impression:
          "作為與朱元璋相識於微的髮妻，馬皇后就像是朱元璋跌宕起伏一生中不可或缺的部分。她不僅是朝夕相伴的枕邊人，是饑餓時滾燙的餅，戰亂時穩固的後盾。他們不僅是攜手走過亂世患難與共的戀人，也是天下定後相互最為瞭解的知己。他們的感情不只是少年人的一見傾心，也不只是帝後之間的相輔相成，從微末走向熾盛的這一路上，他們是彼此最信任親近的同路伴侶。",
      },
      {
        type: "玄",
        num: "089",
        cv: "張喆",
        hobby: "賞玩、妝飾",
        origin: "陳寅恪《柳如是別傳》",
        impression:
          "柳如是從前聽多了文人儒士的家國之思、慷慨陳詞，故而總作男裝打扮。柳如是為人耿直，結交朋友，也最重性情相投。她欣賞魏征心直口快、直言不諱的勇氣；她欣賞嵇康寄情天地、放浪形骸的恣意；她欣賞劉徹不改舊志、欲統幽冥的雄心。她的內心早已不是那緩緩流蕩的秦淮河水，是東海邊的驚濤拍案。她見青山嫵媚，青山見她，如是青山。",
      },
    ],
  },
  {
    id: 13,
    dynasty: "清",
    avatar: [
      {
        type: "地",
        num: "074",
        cv: "張安琪",
        hobby: "博文、書畫",
        origin:
          "【清】蕭穆《敬孚類稿·女士王德卿傳》\n【【民國】趙爾巽等《清史稿·列傳二百九十五》",
        impression:
          "女子著書，為圖名利”、“英年早逝，其謂可惜”……生前身後的瑣碎言論，貞儀從未放在心上。來到忘川讓她欣喜若狂，那些未竟的研究，象數籌算、天文至理……在這裡，她可以盡情沉浸在對理學的探索之中，不為繁瑣的中饋之事牽絆，也不為陳屙病體所累。每每癡迷研究而廢寢忘食之際，也會有擔心她的綠珠等人為她帶來饕餮居的膳食，督促她按時用膳。貞儀常常感歎：“忘川實乃仙境是也！顧臨忘川，吾之幸也。",
      },
      {
        type: "地",
        num: "075",
        cv: "杨昕燃",
        hobby: "博文、賞玩",
        origin:
          "【近代】路大荒《蒲松齡年譜》\n【清】張元《柳泉蒲先生墓表》\n【清】蒲松齡《聊齋自志》",
        impression:
          "蒲松齡少時才名遠揚，彼時心中所念，盡是金榜題名。一次次赴考，一次次落榜，都不能將他的堅持磨損分毫。然後兄弟鬩牆，風流雲散。分家前，他歲歲遊學，遍覽人間風光。分家後，卻只得四處謀生，看遍世態炎涼。境遇跌宕，不改青雲之志。奈何天不遂人願，回望半生，一事未成，已垂垂老矣。",
      },
    ],
  },
  {
    id: 14,
    dynasty: "夢",
    avatar: [
      {
        type: "天",
        num: "020",
        cv: "山新",
        hobby: "樂舞、演武",
        origin: "不詳",
        impression:
          "“陪葬品”——這是崇音初來忘川時對自己的認知，其餘多為茫茫一片。她不知自己從何而來，也不知背後沉重笨拙的青銅鐘、銅木架有何價值。她的意識在不自控的身體中蜷縮為一團，於昏沉中等待著什麼聲響。崇音說，在忘川她不僅要奏昔時之樂，還要譜寫更多嶄新的樂章……",
      },
      {
        type: "天",
        num: "021",
        cv: "陶典",
        hobby: "食珍、賞玩",
        origin: "不詳",
        impression:
          "沉水、瓊脂、龍涎、蘇合……香料，可以讓古老的香氣傳向未來，也可以把深海的氣息帶到大地，多麼神奇啊！銀琰喜歡收集各種各樣的香料，這些香料經她奇思妙想地調製，更加回味悠長，馥鬱而曼妙。銀琰想要認識更多的氣味，想要創造自己的香。",
      },
      {
        type: "天",
        num: "037",
        cv: "昱头",
        hobby: "博文、書畫",
        origin: "【南北朝】《木蘭辭》\n【明】徐渭《雌木蘭替父從軍》",
        impression:
          "忘川中的女子喜歡與花木蘭親近，不單單因為她扮作男裝的樣子英氣秀挺，更因為她有一雙溫柔真摯的眼睛。世人批判呂雉 “陰毒殘忍”、武則天“冷酷狠絕”，鄙薄楊玉環“禍國殃民”、魚玄機“放縱浪蕩”……而花木蘭從不在乎這些。美豔或醜陋，狠厲或柔弱，循規蹈矩或離經叛道，在她眼裡都同樣值得尊重。曾經女扮男裝從軍的她知曉，女子追逐心中所求，需要付出更多隱忍與犧牲，所以她尊重這些罵名背後，屬於她們的“本心”。",
      },
      {
        type: "地",
        num: "057",
        cv: "李世榮",
        hobby: "食珍、演武",
        origin: "【漢】趙曄《吳越春秋·闔閭內傳》",
        impression:
          "莫邪前世為一人投身熔爐，銘刻在她心中的只有那一人的背影，最後的告別莊重而深情。好在如今再也沒有別離，可以與那人在劍爐邊烤火，伴著粥羹，把前世未盡的廝守一一完成。利劍的肅殺凌厲之氣已化為莫邪毫無保留的熱情，杜甫先生可缺針線？虞姬為何歎氣？這是她如今關心的事。",
      },
    ],
  },
  {
    id: 15,
    dynasty: "不詳",
    avatar: [
      {
        type: "黃",
        num: "097",
        cv: "孫嗶",
        hobby: "不詳",
        origin: "不詳",
        impression: "不詳",
      },
      {
        type: "黃",
        num: "098",
        cv: "唐雅菁",
        hobby: "不詳",
        origin: "不詳",
        impression: "不詳",
      },
      {
        type: "黃",
        num: "099",
        cv: "蔡書瑾",
        hobby: "不詳",
        origin: "不詳",
        impression: "不詳",
      },
      {
        type: "黃",
        num: "100",
        cv: "王曉彤",
        hobby: "不詳",
        origin: "不詳",
        impression: "不詳",
      },
      {
        type: "黃",
        num: "101",
        cv: "周帥",
        hobby: "不詳",
        origin: "不詳",
        impression: "不詳",
      },
      {
        type: "黃",
        num: "102",
        cv: "蔡書瑾",
        hobby: "不詳",
        origin: "不詳",
        impression: "不詳",
      },
      {
        type: "黃",
        num: "103",
        cv: "李程遠",
        hobby: "不詳",
        origin: "不詳",
        impression: "不詳",
      },
      {
        type: "黃",
        num: "104",
        cv: "楊夢露",
        hobby: "不詳",
        origin: "不詳",
        impression: "不詳",
      },
      {
        type: "黃",
        num: "105",
        cv: "劉晴",
        hobby: "不詳",
        origin: "不詳",
        impression: "不詳",
      },
    ],
  },
];

const mainSwiper = new Swiper(".main_swiper", {
  loop: true,
  effect: "coverflow",
  grabCursor: true,
  centeredSlides: true,
  slidesPerView: "auto",
  autoplay: {
    delay: 3000,
  },
  coverflowEffect: {
    rotate: 0,
    stretch: 50,
    depth: 400,
    modifier: 1,
    slideShadows: false,
  },
  navigation: {
    nextEl: ".swiper-button-next-main",
    prevEl: ".swiper-button-prev-main",
  },
});

let avatarSwiper; // 注意這裡的變數作用域

avatarSwiper = new Swiper(".avatar-swiper", {
  slidesPerView: 4,
  spaceBetween: 5,
  breakpoints: {
    // 當寬度小於等於 768px
    768: {
      slidesPerView: 8,
      spaceBetween: 5,
    },
  },
  navigation: {
    nextEl: ".swiper-button-next-avatar",
    prevEl: ".swiper-button-prev-avatar",
  },
});

let html = "";
const avatarWrapper = document.querySelector(".avatar-wrapper");

characterList[0].avatar.forEach((item, idx) => {
  html += `<div class="swiper-slide">
<img src="img/character/${item.num}_s.png" alt="">
</div>`;
  avatarWrapper.innerHTML = html;
});
menuSwiper = new Swiper(".menu_swiper", {
  loop: true,
  centeredSlides: true,
  slidesPerView: 3,
  slideToClickedSlide: true,
  spaceBetween: 0,
  // allowTouchMove: false,
  breakpoints: {
    768: {
      slidesPerView: 7,
      direction: "vertical",
    },
  },
  on: {
    click: function () {
      const index = this.realIndex;
      // 將屬性設定為 "全"
      setAttributeToAll();
      updateAvatarSlides(index);
    },
    slideChangeTransitionEnd: function () {
      const index = this.realIndex;
      // 將屬性設定為 "全"
      setAttributeToAll();
      updateAvatarSlides(index);
      // updateSpecialSlideSizes(this);
    },
    // init: function () {
    //   updateSpecialSlideSizes(this);
    // },
  },
});

function updateSpecialSlideSizes(swiper) {
  // 首先，移除所有slides上的 'first-visible-slide' 和 'last-visible-slide' 类
  Array.from(swiper.slides).forEach(slide => {
    slide.classList.remove('first-visible-slide');
    slide.classList.remove('last-visible-slide');
  });

  // 然后，为当前可见的第一个和最后一个slide添加相应的类
  const firstVisibleSlide = swiper.slides[swiper.activeIndex];
  const lastVisibleSlide = swiper.slides[swiper.activeIndex + swiper.params.slidesPerView - 1];

  if (firstVisibleSlide) firstVisibleSlide.classList.add('first-visible-slide');
  if (lastVisibleSlide) lastVisibleSlide.classList.add('last-visible-slide');
}


function setAttributeToAll() {
  const types = document.querySelectorAll(".type");
  types.forEach((t) => t.classList.remove("selected"));
  document.querySelector('.type[data-type="全"]').classList.add("selected");
}

function getSelectedType() {
  const selected = document.querySelector(".type.selected");
  if (selected) {
    return selected.getAttribute("data-type");
  }
  return null;
}

function updateAvatarSlides(dynastyIndex) {
  const avatarWrapper = document.querySelector(".avatar-wrapper");

  // 清除目前所有的swiper-slide
  while (avatarWrapper.firstChild) {
    avatarWrapper.removeChild(avatarWrapper.firstChild);
  }

  let selectedType = getSelectedType();

  let filteredCharacters;

  if (selectedType === "全") {
    // 如果选中的是 "全"，则不过滤
    filteredCharacters = characterList[dynastyIndex].avatar;
  } else {
    filteredCharacters = characterList[dynastyIndex].avatar.filter(
      (item) => item.type === selectedType
    );
  }

  filteredCharacters.forEach((item, idx) => {
    const slide = document.createElement("div");
    slide.className = "swiper-slide avatar-slide";

    const img = document.createElement("img");
    img.src = `img/character/${item.num}_s.png`;
    img.setAttribute("id", item.num);
    img.alt = "";

    slide.appendChild(img);
    avatarWrapper.appendChild(slide);
  });

  avatarSwiper.update();
}

const types = document.querySelectorAll(".type");

types.forEach((type) => {
  type.addEventListener("click", function () {
    // 从被点击的元素中获取类型
    const selectedType = this.getAttribute("data-type");

    // 更新选中的 type 的样式（这部分根据您的设计决定如何实现）
    types.forEach((t) => t.classList.remove("selected"));
    this.classList.add("selected");

    const dynastyIndex = menuSwiper.realIndex;
    updateAvatarSlides(dynastyIndex);
  });
});

// 切換角色大圖
document
  .querySelector(".avatar-swiper")
  .addEventListener("click", function (event) {
    if (event.target.tagName === "IMG") {
      var match = event.target.src.match(/(\d+)_s\.png$/);

      if (match && match[1]) {
        var showRoleImg = document.querySelector(".show_role .photo");

        showRoleImg.setAttribute("data-id", match[1]);
        showRoleImg.classList.add("fade-out");

        setTimeout(function () {
          showRoleImg.src = "img/character/" + match[1] + ".png";
          showRoleImg.classList.remove("fade-out");
        }, 500);
      }
    }
  });

// cv
const audioElement = document.getElementById("myAudio");
document.querySelector(".ch_speaker").addEventListener("click", function () {
  audioElement.play();
});
const chSpeakerElement = document.querySelector(".ch_speaker");
// 當音檔開始播放時
audioElement.addEventListener("play", function () {
  chSpeakerElement.classList.add("active");
});
// 當音檔播放完畢時
audioElement.addEventListener("ended", function () {
  chSpeakerElement.classList.remove("active");
});

document
  .querySelector(".avatar-wrapper")
  .addEventListener("click", function (e) {
    if (e.target.tagName === "IMG" && e.target.closest(".avatar-slide")) {
      // 確保點擊的是 .avatar-slide 下的 img
      const srcFilename = e.target.src.split("/").pop().split("_")[0]; // 從 src 屬性中提取檔名的 "0xx" 部分
      chSpeakerElement.classList.remove("active");
      // 尋找匹配的角色數據
      let matchedCharacter = null;
      for (let dynasty of characterList) {
        for (let avatar of dynasty.avatar) {
          if (avatar.num === srcFilename) {
            matchedCharacter = avatar;
            break;
          }
        }
        if (matchedCharacter) break; // 早期結束外部循環
      }

      // 更新 .name 的內容
      if (matchedCharacter) {
        document.querySelector(".name").innerText = matchedCharacter.cv;
        // 更新音頻元素的 src 並播放
        const audioElement = document.getElementById("myAudio");
        audioElement.src = `cv/${srcFilename}.mp3`;
      } else {
        console.error("No character found for src filename:", srcFilename);
      }
    }
  });

// -------- 角色 影片彈窗 -------- 開始 //
// 彈窗關閉 button
const infBtn = document.querySelector(".info_btn");
const characterPopup = document.querySelector(".character_popup");
// 點擊輪播開啟彈窗
if (infBtn) {
  infBtn.addEventListener("click", () => {
    characterPopup.style.display = "flex";
    setTimeout(() => {
      characterPopup.style.opacity = "100";
    }, 50);
  });

  const characterPopupClose = document.querySelector(
    ".character_popup .popup_close"
  );
  characterPopupClose.addEventListener("click", () => {
    closeKvVideo();
    characterPopup.style.opacity = "0";
    setTimeout(() => {
      characterPopup.style.display = "none";
    }, 300);
  });
}
// -------- 角色 影片彈窗 -------- 結束 //

document.querySelector(".info_btn").addEventListener("click", function () {
  // 獲取當前.show_role底下.photo的data-id
  const currentDataId = document
    .querySelector(".show_role .photo")
    .getAttribute("data-id");

  // 尋找匹配的角色數據
  let matchedCharacter = null;
  for (let dynasty of characterList) {
    for (let avatar of dynasty.avatar) {
      if (avatar.num === currentDataId) {
        matchedCharacter = avatar;
        break;
      }
    }
  }

  // 更新div.role_info的內容
  if (matchedCharacter) {
    document.querySelector(".role_info .origin .text").innerText =
      matchedCharacter.origin;
    document.querySelector(".role_info .hobby .text").innerText =
      matchedCharacter.hobby;
    document.querySelector(".role_info .impression .text").innerText =
      matchedCharacter.impression;
  } else {
    console.error("No character found for data-id:", currentDataId);
  }
});

// ------------------------ 角色開始 ------------------------ 結束 //
