const characterList = [
  {
    id: 1,
    dynasty: "先秦",
    avatar: [
      {
        type: "天",
        num: "003",
        cv: "趙路",
        hobby: "雅宴、弈棋",
        info: "【漢】司馬遷《史記·老子韓非列傳》",
        impression:
          "生為韓國公子，命遇戰國亂世，韓非將他的謀算藏在心底，抱負訴於筆下，窺測世情，洞察人性。君臣之道為何，駕馭天下之法為何？刑名律條當如何解，太平盛世又將安在？韓非沉潛於治亂興亡之道，將所得凝結為歷歷書簡。甚至如今在忘川，他也時刻關注著後世之事，好讓自己的學說與時俱進。",
      },
      {
        type: "天",
        num: "009",
        cv: "史澤鯤",
        hobby: "博文、雅宴",
        info: "【西漢】司馬遷《史記》",
        impression:
          "屈原一度受楚王重用，有明於治亂、嫻於辭令之譽。可惜身不由己、事與願違，他想要施展才華，卻遭遇兩次流放；渴望守護楚國，卻只能遙泣郢都城破。屈原不容許自身皓皓之白蒙受俗塵的侵染，亦不堪親眼目送故國的小舟傾覆於亂世的驚濤。幾度江潭羈旅，日日憔悴行吟，雖曾逢漁父一言相勸，他終不改狐死首丘之心，親踐寧赴湘流之語。",
      },
      {
        type: "天",
        num: "016",
        cv: "龜娘",
        hobby: "樂舞、品茗",
        info: "【戰國】墨翟及其弟子等《墨子·親士》\n【東漢】趙曄《吳越春秋》",
        impression:
          "西施是水做的人兒，清澈如水，溫柔如水，乾淨亦如水。西施的居所纖塵不染，洗得鋥亮的地面莫說一根頭髮，便是一粒灰塵也見不到，來訪者亦被要求換上西施家中特備的木屐。西施的衣裳總是時時刻刻煥亮如新，縱是披地的白紗也不曾沾染些許醃臜，令忘川名士們嘖嘖稱奇。",
      },
      {
        type: "天",
        num: "038",
        cv: "程玉珠",
        hobby: "博文、弈棋",
        info: "【春秋】孫武《孫子兵法·用間》\n戰國】佚名《逸周書·卷四·克殷解》\n【戰國】尉繚《尉繚子·武議》\n漢】司馬遷《史記·齊太公世家》",
        impression:
          "旁人總覺得姜太公德高望重，應當是仙風道骨或威嚴有加之人，其實不然。遍嘗過市井冷眼，也享受過萬人尊崇的太公，在來到忘川之後，每穿著似平民老叟，一魚簍，一斗笠，一竿，一河，怡然自得。返璞歸真，用以形容姜太公，則恰如其分。又有誰能瞧出，那個在忘川畔垂釣的平凡老翁，曾是一釣顯貴的“師尚父”呢？",
      },
      {
        type: "地",
        num: "047",
        cv: "斑馬",
        hobby: "賞玩、弈棋",
        info: "【漢】司馬遷《史記·越王勾踐世家》\n【漢】趙曄《吳越春秋·勾踐入臣外傳》",
        impression:
          "范蠡初到忘川時，憑藉純真善良的孩童樣貌，賺得一手好人緣。可沒過幾日，名士們就發現，這小孩沒這麼簡單。他無賴起來能將普通石頭當作玉石，把劉邦誆得團團轉；正經起來又能一語道破張良的君臣之道。財神爺眼珠轉上一轉，就有人要做虧本買賣。“倚小賣小”一詞幾乎被他寫在臉上，也無人奈何得了。有人疑惑為何佛印要以孩童面貌來到忘川，可范蠡做如此選擇，在眾名士眼中似乎順理成章：永遠保持好奇，永遠樂於尋求變化和機遇。",
      },
      {
        type: "地",
        num: "051",
        cv: "樊俊航",
        hobby: "雅宴、演武",
        info: "【漢】司馬遷《史記·刺客列傳》\n【漢】劉向《戰國策·燕策》",
        impression:
          "荊軻一生最重，莫過於一個“義”字。他一生中最重要的兩個人，一個是燕太子丹。他頂著易水河畔的刺骨冷風、冒著秦軍鐵蹄的滾滾煙塵，抱著必死的決心走進秦國王宮，都只為回報燕太子丹的知遇之恩。另一個是高漸離，在秦王宮的大殿上，看著自己的鮮血流淌滿地的那一刻，荊軻最遺憾的，是再也聽不見漸離的築聲。",
      },
      {
        type: "地",
        num: "063",
        cv: "沈磊",
        hobby: "雅宴、樂舞",
        info: "【漢】司馬遷《史記·刺客列傳》\n【漢】劉向《戰國策·燕策》",
        impression:
          "他的築聲能引忘川飛鳥停歇，群獸止步。有人說他是忘川中最易相處之人，卻又是最難親近之人。他好像林間清風，待人永遠溫文爾雅，遇之令人心曠神怡，卻又像山中明月，遙隔萬裡，旁人永遠無法進入他真正的內心。",
      },
      {
        type: "玄",
        num: "093",
        cv: "沈磊",
        hobby: "雅宴、食珍",
        info: "【漢】趙曄《吳越春秋·闔閭內傳》\n【三國】曹丕《列異傳》",
        impression:
          "有干將的地方，就有打鐵聲，日夜不歇，名士們不堪其擾，頂著烏黑的眼眶來找干將算賬。卻見干將鑄完的新劍，投入爐中熔斷。其劍鋒芒耀目，吹發可斷，堪稱“神兵”，在場名士莫不惋惜，詢問其因，干將卻只掄了掄錘子，不發一言，又投入了下一把新劍的鍛造中。其實，如今的干將不僅是鑄劍師，也是首飾打造師，噓，此為機密。沒人知道干將這樣一個漢子，如何能有這等巧思",
      },
    ],
  },
  {
    id: 2,
    dynasty: "秦",
    avatar: [
      {
        type: "天",
        num: "002",
        cv: "吳磊",
        hobby: "演武、賞玩",
        info: "【漢】司馬遷《史記·秦始皇本紀》\n【明】李贄《藏書·世紀列傳總目》",
        impression:
          "嬴政到了忘川不久，便當選為千工社社長，主持兵馬俑修造事宜，為此殫精竭慮，耗費萬金。家中圖紙盈室，旁人過府拜謁，幾乎沒有落腳的地方，再一看臥室，竟連床上都堆滿了石膏部件。生前大肆修造陶俑便罷了，死後也不甘休，忘川名士都議論紛紛，甚為不解。嬴政統統不予理會，他要做的事，毋須他人置喙。",
      },
      {
        type: "天",
        num: "032",
        cv: "趙嶺",
        hobby: "博文、書畫",
        info: "【漢】司馬遷《史記·李斯列傳》》\n【漢】司馬遷《史記·秦始皇本紀》》\n【漢】佚名《趙正書》",
        impression:
          "彼時天下方爭之世，正是李斯一展抱負之時。讀過滿腹詩書，去國離鄉，尚未立不世之功，又怎甘於在《逐客令》下後，黯然離去？“不問可否，不論曲直……此非所以跨海內制諸侯之術也。”洋洋灑灑、字字珠璣，不僅令秦王回心轉意，也讓“李斯”這個名字在歷史上留下不可磨滅的痕跡。",
      },
      {
        type: "玄",
        num: "087",
        cv: "張琦",
        hobby: "賞玩、妝飾",
        info: "【漢】司馬遷《史記·貨殖列傳》\n【漢】班固《漢書·貨殖傳》",
        impression:
          "巴清是一個和誰都能相處融洽的女人，孤傲如嬴政亦要敬其三分，驕狂如霍去病也不會對她無禮，恣意如李太白也不會對她放肆。她可謂忘川中的遊魚，左右逢源，縱然閻君親臨，也能談笑自如，順便在言笑之間說服閻君同意將五湖商社生意擴展到幽冥酆都。",
      },
    ],
  },
  {
    id: 3,
    dynasty: "西楚",
    avatar: [
      {
        type: "天",
        num: "023",
        cv: "劉飛",
        hobby: "雅宴、演武",
        info: "【西漢】司馬遷《史記·項羽本紀》",
        impression:
          "距離垓下之戰兵敗、項羽烏江自刎，已經不知過了多少年，每年的此時，項羽都會提上兩壺好酒，來到忘川河邊，祭奠軍中的亡魂。世人提及西楚霸王，或是敬他威名蓋世、神勇無雙，或是歎他仁義愛人，卻英雄末路。可無人知道，成為名士不入輪回的他，背負著的是什麼。 在忘川的無數個日夜，項羽仍能時時聽見耳畔傳來楚歌，那或許是陣下軍士在渡過忘川河時發出的悲泣。",
      },
      {
        type: "地",
        num: "055",
        cv: "林簌",
        hobby: "樂舞、演武",
        info: "【漢】司馬遷《史記·項羽本紀》",
        impression:
          "她是忘川絕世的劍舞者，美人如玉劍如虹。人人皆知虞姬對自己雙劍愛若珍寶，雙劍失竊，她便誓要將偷竊的小鬼粉身碎骨，縱然被人議論脾氣火爆，也決不甘休。因為只有虞姬自己知道，雙劍於她，早已不是尋常兵器那樣簡單。劍乃傷人利器，可對虞姬而言，劍，也是英雄之兵。她永不會忘記被人欺凌，只能以匕首自保的歲月。",
      }
    ],
  },
  {
    id: 4,
    dynasty: "漢",
    avatar: [
      {
        type: "天",
        num: "007",
        cv: "翟巍",
        hobby: "博文、弈棋",
        info: "【漢】司馬遷《史記·留侯世家》\n漢】班固《漢書·張陳王周傳》",
        impression:
          "論及張良，忘川名士定會說：“謙謙君子，當如是。”出身韓國貴族，他的行動坐臥皆儒雅風流，不浴不冠不焚香必不見客，琴棋書畫樣樣精通，忘川雅士當屬他為先，然而他卻常常笑歎道：“不過是無用之學。”君子，渡天下，亦渡己。",
      },
      {
        type: "天",
        num: "011",
        cv: "倔強的小紅",
        hobby: "弈棋、演武",
        info: "【漢】司馬遷《史記·淮陰侯列傳》\n【漢】司馬遷《史記·項羽本紀》\n【漢】司馬遷《史記·高祖本紀》",
        impression:
          "韓信統軍以來，定三秦，涉西河，虜魏王，擒夏說，又引兵下井陘，徇趙，脅燕，定齊，南摧楚人之兵二十萬，東殺龍且，西懾項羽，功無二於天下。韓信少有朋友，也很少需要朋友，或許兵書與象棋就是韓信心中的至樂之物了。",
      },
      {
        type: "天",
        num: "013",
        cv: "姜廣濤",
        hobby: "演武、樂舞",
        info: "【西晉】陳壽《三國志·吳書·周瑜傳》",
        impression:
          "他是精雕細刻的無瑕美玉，藏諸笥櫝；是玉露澆灌的謙謙青松，養於庭階。周瑜生於官宦之家，如群星生於銀河，在天外俯瞰人世，無涉世間哀苦。公卿世族，庭訓規整，舉動必遵禮法；精研音律，言議英發，行止自是風雅。而朝廷式微，禍及門楣，奸臣當道，群雄紛起，誰還甘做一世舒城春柳下的顧曲少年？",
      },
      {
        type: "天",
        num: "014",
        cv: "蘇尚卿",
        hobby: "演武、弈棋",
        info: "【西晉】陳壽《三國志·吳書·孫破虜討逆傳》（含裴松之注）",
        impression:
          "他誕生於烽火中，眼看父親一路披荊斬棘，從布衣躋身群雄，江東之虎的血脈令他自覺生來不凡。十七歲，父親身死，帶走這個家族短暫的繁華；十九歲，重整旗鼓，他在一片廢墟中開天闢地。他有每個少年都有的癡心狂想，也有其他少年沒有的不顧一切的勇氣。他生在亂世，就是為了當英雄的。",
      },
      {
        type: "天",
        num: "029",
        cv: "曹真",
        hobby: "食珍、演武",
        info: "【漢】司馬遷《史記·衛將軍驃騎列傳》\n【漢】班固《漢書·衛青霍去病傳》",
        impression:
          "衛青來到忘川之後，依舊沒有改變舊日在軍中的習氣。每日卯時起，亥時休。無論是颳風下雨還是驕陽似火，他總是雷打不動地每日演武一個時辰，繞著金戈館跑馬一個時辰。忘川名士上街，總能看見衛大將軍騎著汗血寶馬的颯爽英姿。",
      },
      {
        type: "天",
        num: "033",
        cv: "梁達偉",
        hobby: "博文、演武",
        info: "【漢】司馬遷《史記·孝武本紀》\n【漢】班固《漢書·武帝紀》",
        impression:
          "文景之治承平日久，生齒日繁，少年劉徹卻不因河清海晏的治世圖景而洋洋自得，始終希望有朝一日能夠建立一支鐵血部隊為大漢王朝解決邊患、開疆拓土。建元三年，漢軍出征閩越，開大漢揚威之先聲。歷經數十載戎馬征伐，攘四夷而廣土斥境，嶺南河套重歸中原版圖，河西四郡也成大漢鐵騎縱橫馳騁的疆土，唯見匈奴紛北卻，絲路連西東。",
      },
      {
        type: "天",
        num: "042",
        cv: "唐雅菁",
        hobby: "樂舞、書畫",
        info: "【漢】班固《漢書·匈奴傳》\n【南朝宋】范曄《後漢書·南匈奴列傳》",
        impression:
          "當風雪覆蓋忘川，棠梨坊總會傳出琵琶的曲調。慢撚輕抹，恍若碎玉落瓷盤，那清冷掖庭寂寂深宮，那塞上蠻荒風沙覆面，都傾訴曲間，緩緩流淌。所有人都知道，那是王昭君又陷入了往事的回憶。",
      },
      {
        type: "天",
        num: "046",
        cv: "黑石稔",
        hobby: "食珍、賞玩",
        info: "【漢】司馬遷《史記·大宛列傳》\n【漢】班固《漢書·張騫李廣利傳》",
        impression:
          "出隴西，通絕域，窮河源，晝與夜、光與影籠罩的西行之路，恰如張騫人生軌跡般，時有大起大落。他曾登至沙山之巔，目見莽莽平沙被風捲入天際，天地晝晦間向前伸出手掌，僅咫尺之距也無法相辨五指；他也曾從陡峭如削之坡跌入深谷，卻見大河水澤潛行地下，步步徐行逆流而去，尋至源頭只歎造化機巧。去路雖常不可見，但只要有漢節緊握於掌中，希望之火便會長燃在張騫心底。",
      },
      {
        type: "地",
        num: "052",
        cv: "唐小喜",
        hobby: "演武、妝飾",
        info: "【西晉】陳壽《三國志·吳書·周瑜傳》",
        impression:
          "無論是幼時為自己紮髻時的柔聲細語，還是戰亂流離時緊緊攥住自己的手，抑或是每一件針腳細密、繡工精緻的衣裳……小喬總是能在日常的點滴瑣事中，窺見姐姐對自己的愛護。姐妹二人經逢亂世，飄搖凋零，卻又有幸於忘川重聚。九泉之井中，小喬再次牽住姐姐的手，往日烽煙又浮現眼前，那時的她在心底暗暗發誓：今後我一定要變強，保護好姐姐！",
      },
      {
        type: "地",
        num: "054",
        cv: "李正翔",
        hobby: "食珍、演武",
        info: "【漢】司馬遷《史記·衛將軍驃騎列傳》\n【漢】班固《漢書·衛青霍去病傳》",
        impression:
          "霍去病是忘川的驕陽，無論誰見了他，都忍不住贊一句“好一個漢家兒郎！”他驕傲自負，遍數忘川，得他真心崇敬之人寥寥可數，他的舅舅衛青是其中之一。他是一匹不屈的驍狼，從前他的尖牙利爪為大漢而戰，而今，他願為忘川橫槍躍馬，萬死莫辭。",
      },
      {
        type: "地",
        num: "058",
        cv: "李世榮",
        hobby: "樂舞、妝飾",
        info: "【漢】司馬遷《史記·外戚世家》\n【漢】班固《漢書·外戚傳上》",
        impression:
          "塵封的回憶裡，記載了那年秋天長安遍地的鮮血，衛子夫走過屍橫遍野的戰場，曳地的裙擺染上洗不淨的血污。誰能想像，一個柔弱如花的女人，竟然有膽量起兵反抗那莫須有的誣陷。可是，一切終難回首，帝王收回後璽的命令冷漠無情，三尺白綾，飄蕩的素色裙擺如頹敗的名花，她知道，唯有一死，才能自證清白。",
      },
      {
        type: "地",
        num: "062",
        cv: "閻萌萌",
        hobby: "妝飾、書畫",
        info: "【晉】陳壽《三國志·吳書·周瑜傳》",
        impression:
          "皖縣雖小，卻有著小橋流水，翠樹生花，承載著大喬少女時期安穩平靜的生活。在父親的庇護下，大喬養成了溫柔嫻雅，知書達理的性子。她埋首於一針一線，詩文萬卷。閒暇時與妹妹笑談杏梨如雪，暢言閨中思緒。亂世之下，未經人間疾苦。她明白，能夠來到忘川，聽著妹妹的聲聲呼喚，作為平常人家的女子生活，做想做的事，見想見的人，這未嘗不是一種幸運。",
      },
      {
        type: "地",
        num: "068",
        cv: "賈邱",
        hobby: "雅宴、賞玩",
        info: "【漢】司馬遷《史記·高祖本紀》\n【漢】班固《漢書·高帝紀》",
        impression:
          "劉邦是忘川帝王裡最不正經的一個，雖然部分名士對他的手段嗤之以鼻，但他在金戈館中卻是勝率最高的。劉邦的眼神多數時候和他的身形一樣懶散，只有想到哪些名士能助自己在忘川建立基業時，眼中偶爾閃過一道狡黠的精芒。劉邦沒有帝王包袱，為達目的何止不擇手段，原則道義都可拋諸腦後。",
      },
      {
        type: "地",
        num: "069",
        cv: "張安琪",
        hobby: "弈棋、賞玩",
        info: "【漢】司馬遷《史記·呂太后本紀》\n【漢】班固《漢書·高後紀》",
        impression:
          "敬請期待。",
      },
      {
        type: "玄",
        num: "088",
        cv: "王曉彤",
        hobby: "博文、弈棋",
        info: "【西漢】司馬遷《史記·絳侯周勃世家》《史記·外戚世家》",
        impression:
          "許負號稱是忘川最為神秘的名士之一。因為她一向不愛出門，大家都懷疑她有社交恐懼症。連袁天罡登門拜訪，都被一本無字天書打發了去。傳聞她精通蔔算，足不出戶，僅聞人聲，就蔔得出來訪者數十載的往事與前程。",
      },
      {
        type: "玄",
        num: "094",
        cv: "劉垚",
        hobby: "書畫、食珍",
        info: "【漢】劉歆《西京雜記·卷二》",
        impression:
          "若非史籍白紙黑字的記載，忘川眾人無論如何也不願相信，毛延壽曾是西漢宮廷裡公認最有天賦的畫師。那雜亂的色塊、扭曲的形體、稚拙的筆觸，有人學習後世的辭彙，婉轉地稱之為“抽象派”，也有人不屑地嘲笑他是“鬼畫符”。可毛延壽從未想要改變他的畫風，精緻的線條勾勒不出他眼裡的世界：群山是會咆哮的，太陽是會融化的，黑夜是會吃人的…",
      },
      {
        type: "地",
        num: "106",
        cv: "張若瑜",
        hobby: "賞玩、妝飾",
        info: "【漢】班固《漢書》\n【宋】司馬光《資治通鑒》",
        impression:
          "漢家宮闕在西風殘照中漸漸遠去，走進烏孫國的那一刻，解憂才發現這裡並不像她想像中那般荒蠻。連天的草浪、成群的牛羊，這些殊異於中原的景色，在漫漫歲月中，漸漸融入她的骨血。於是她下定決心，除卻要肩負起大漢公主的使命，亦要助烏孫擺脫匈奴襲擾。解憂解憂，她定要窮盡此生，解兩國百姓之憂。",
      }
    ],
  },
];
